PastaParalelo/paralelo/app/controllers/memes_controller.rb

SELECT "memes".* FROM "memes"
---
  def index
    @memes = Meme.all

INSERT INTO "memes" ("title", "category", "link", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "fece"], ["category", "rece"], ["link", "cercer"], ["description", "crecer"], ["created_at", "2019-11-28 13:34:32.112691"], ["updated_at", "2019-11-28 13:34:32.112691"]]
---
  def create
    @meme = Meme.new(meme_params)

    respond_to do |format|
      if @meme.save

UPDATE "memes" SET "link" = ?, "updated_at" = ? WHERE "memes"."id" = ?  [["link", "https://i.kym-cdn.com/entries/icons/original/000/000/091/TrollFace.jpg"], ["updated_at", "2019-11-28 17:18:42.413632"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @meme.update(meme_params)

DELETE FROM "memes" WHERE "memes"."id" = ?  [["id", 4]]
---
  def destroy
    @meme.destroy

SELECT "memes".* FROM "memes" WHERE "memes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_meme
      @meme = Meme.find(params[:id])